FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/uart/fsl_adapter_uart.h
/*
 * Copyright 2018-2020 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef __HAL_UART_ADAPTER_H__
    #define __HAL_UART_ADAPTER_H__

    #include "fsl_common.h"
    #if defined( SDK_OS_FREE_RTOS )
        #include "FreeRTOS.h"
    #endif

/*!
 * @addtogroup UART_Adapter
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief Enable or disable UART adapter non-blocking mode (1 - enable, 0 - disable) */
    #ifdef DEBUG_CONSOLE_TRANSFER_NON_BLOCKING
        #define UART_ADAPTER_NON_BLOCKING_MODE        ( 1U )
    #else
        #ifndef SERIAL_MANAGER_NON_BLOCKING_MODE
            #define UART_ADAPTER_NON_BLOCKING_MODE    ( 0U )
        #else
            #define UART_ADAPTER_NON_BLOCKING_MODE    SERIAL_MANAGER_NON_BLOCKING_MODE
        #endif
    #endif

    #if defined( __GIC_PRIO_BITS )
        #ifndef HAL_UART_ISR_PRIORITY
            #define HAL_UART_ISR_PRIORITY    ( 25U )
        #endif
    #else
        #if defined( configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY )
            #ifndef HAL_UART_ISR_PRIORITY
                #define HAL_UART_ISR_PRIORITY    ( configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY )
            #endif
        #else

/* The default value 3 is used to support different ARM Core, such as CM0P, CM4, CM7, and CM33, etc.
 * The minimum number of priority bits implemented in the NVIC is 2 on these SOCs. The value of mininum
 * priority is 3 (2^2 - 1). So, the default value is 3.
 */
            #ifndef HAL_UART_ISR_PRIORITY
                #define HAL_UART_ISR_PRIORITY    ( 3U )
            #endif
        #endif
    #endif /* if defined( __GIC_PRIO_BITS ) */

    #ifndef HAL_UART_ADAPTER_LOWPOWER
        #define HAL_UART_ADAPTER_LOWPOWER    ( 0U )
    #endif /* HAL_UART_ADAPTER_LOWPOWER */

    #ifndef HAL_UART_ADAPTER_FIFO
        #define HAL_UART_ADAPTER_FIFO    ( 0U )
    #endif /* HAL_UART_ADAPTER_FIFO */

    #ifndef HAL_UART_DMA_ENABLE
        #define HAL_UART_DMA_ENABLE    ( 0U )
    #endif /* HAL_UART_DMA_ENABLE */

/*! @brief Definition of uart dma adapter software idleline detection timeout value in ms. */
    #ifndef HAL_UART_DMA_IDLELINE_TIMEOUT
        #define HAL_UART_DMA_IDLELINE_TIMEOUT    ( 1U )
    #endif /* HAL_UART_DMA_IDLELINE_TIMEOUT */

/*! @brief Definition of uart adapter handle size. */
    #if ( defined( UART_ADAPTER_NON_BLOCKING_MODE ) && ( UART_ADAPTER_NON_BLOCKING_MODE > 0U ) )
        #define HAL_UART_HANDLE_SIZE          ( 92U + HAL_UART_ADAPTER_LOWPOWER * 16U + HAL_UART_DMA_ENABLE * 4 )
        #define HAL_UART_BLOCK_HANDLE_SIZE    ( 8U + HAL_UART_ADAPTER_LOWPOWER * 16U + HAL_UART_DMA_ENABLE * 4 )
    #else
        #define HAL_UART_HANDLE_SIZE          ( 8U + HAL_UART_ADAPTER_LOWPOWER * 16U + HAL_UART_DMA_ENABLE * 4 )
    #endif

/*! @brief Definition of uart dma adapter handle size. */
    #if ( defined( HAL_UART_DMA_ENABLE ) && ( HAL_UART_DMA_ENABLE > 0U ) )
        #if ( defined( FSL_FEATURE_SOC_DMA_COUNT ) && ( FSL_FEATURE_SOC_DMA_COUNT > 0U ) )
            #define HAL_UART_DMA_HANDLE_SIZE    ( 124U )
        #elif ( defined( FSL_FEATURE_SOC_EDMA_COUNT ) && ( FSL_FEATURE_SOC_EDMA_COUNT > 0U ) )
            #define HAL_UART_DMA_HANDLE_SIZE    ( 140U )
        #else
            #error This SOC does not have DMA or EDMA available!
        #endif
    #endif /* HAL_UART_DMA_ENABLE */

/*!
 * @brief Defines the uart handle
 *
 * This macro is used to define a 4 byte aligned uart handle.
 * Then use "(hal_uart_handle_t)name" to get the uart handle.
 *
 * The macro should be global and could be optional. You could also define uart handle by yourself.
 *
 * This is an example,
 * @code
 * UART_HANDLE_DEFINE(uartHandle);
 * @endcode
 *
 * @param name The name string of the uart handle.
 */
    #define UART_HANDLE_DEFINE( name )    uint32_t name[ ( ( HAL_UART_HANDLE_SIZE + sizeof( uint32_t ) - 1U ) / sizeof( uint32_t ) ) ]

    #if ( defined( HAL_UART_DMA_ENABLE ) && ( HAL_UART_DMA_ENABLE > 0U ) )
        #define UART_DMA_HANDLE_DEFINE( name ) \
    uint32_t name[ ( ( HAL_UART_DMA_HANDLE_SIZE + sizeof( uint32_t ) - 1U ) / sizeof( uint32_t ) ) ]
    #endif

/*! @brief Whether enable transactional function of the UART. (0 - disable, 1 - enable) */
    #ifndef HAL_UART_TRANSFER_MODE
        #define HAL_UART_TRANSFER_MODE    ( 0U )
    #endif

/*! @brief The handle of uart adapter. */
    typedef void   * hal_uart_handle_t;

/*! @brief The handle of uart dma adapter. */
    typedef void   * hal_uart_dma_handle_t;

/*! @brief UART status */
    typedef enum _hal_uart_status
    {
        kStatus_HAL_UartSuccess = kStatus_Success,                        /*!< Successfully */
        kStatus_HAL_UartTxBusy = MAKE_STATUS( kStatusGroup_HAL_UART, 1 ), /*!< TX busy */
        kStatus_HAL_UartRxBusy = MAKE_STATUS( kStatusGroup_HAL_UART, 2 ), /*!< RX busy */
        kStatus_HAL_UartTxIdle = MAKE_STATUS( kStatusGroup_HAL_UART, 3 ), /*!< HAL UART transmitter is idle. */
        kStatus_HAL_UartRxIdle = MAKE_STATUS( kStatusGroup_HAL_UART, 4 ), /*!< HAL UART receiver is idle */
        kStatus_HAL_UartBaudrateNotSupport =
            MAKE_STATUS( kStatusGroup_HAL_UART, 5 ),                      /*!< Baudrate is not support in current clock source */
        kStatus_HAL_UartProtocolError = MAKE_STATUS(
            kStatusGroup_HAL_UART,
            6 ),                                                         /*!< Error occurs for Noise, Framing, Parity, etc.
                                                                          *   For transactional transfer, The up layer needs to abort the transfer and then starts again */
        kStatus_HAL_UartError = MAKE_STATUS( kStatusGroup_HAL_UART, 7 ), /*!< Error occurs on HAL UART */
    } hal_uart_status_t;

/*! @brief UART parity mode. */
    typedef enum _hal_uart_parity_mode
    {
        kHAL_UartParityDisabled = 0x0U, /*!< Parity disabled */
        kHAL_UartParityEven = 0x2U,     /*!< Parity even enabled */
        kHAL_UartParityOdd = 0x3U,      /*!< Parity odd enabled */
    } hal_uart_parity_mode_t;

