FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/uart/fsl_adapter_uart.h
    #if ( defined( UART_ADAPTER_NON_BLOCKING_MODE ) && ( UART_ADAPTER_NON_BLOCKING_MODE > 0U ) )
/*! @brief UART Block Mode. */
        typedef enum _hal_uart_block_mode
        {
            kHAL_UartNonBlockMode = 0x0U, /*!< Uart NonBlock Mode */
            kHAL_UartBlockMode = 0x1U,    /*!< Uart Block Mode */
        } hal_uart_block_mode_t;
    #endif /* UART_ADAPTER_NON_BLOCKING_MODE */

/*! @brief UART stop bit count. */
    typedef enum _hal_uart_stop_bit_count
    {
        kHAL_UartOneStopBit = 0U, /*!< One stop bit */
        kHAL_UartTwoStopBit = 1U, /*!< Two stop bits */
    } hal_uart_stop_bit_count_t;

/*! @brief UART configuration structure. */
    typedef struct _hal_uart_config
    {
        uint32_t srcClock_Hz;                   /*!< Source clock */
        uint32_t baudRate_Bps;                  /*!< Baud rate  */
        hal_uart_parity_mode_t parityMode;      /*!< Parity mode, disabled (default), even, odd */
        hal_uart_stop_bit_count_t stopBitCount; /*!< Number of stop bits, 1 stop bit (default) or 2 stop bits  */
        uint8_t enableRx;                       /*!< Enable RX */
        uint8_t enableTx;                       /*!< Enable TX */
        uint8_t enableRxRTS;                    /*!< Enable RX RTS */
        uint8_t enableTxCTS;                    /*!< Enable TX CTS */
        uint8_t instance;                       /*!< Instance (0 - UART0, 1 - UART1, ...), detail information please refer to the
                                                 *   SOC corresponding RM.
                                                 *   Invalid instance value will cause initialization failure. */
        #if ( defined( UART_ADAPTER_NON_BLOCKING_MODE ) && ( UART_ADAPTER_NON_BLOCKING_MODE > 0U ) )
            hal_uart_block_mode_t mode;         /*!< Uart  block mode */
        #endif /* UART_ADAPTER_NON_BLOCKING_MODE */
        #if ( defined( HAL_UART_ADAPTER_FIFO ) && ( HAL_UART_ADAPTER_FIFO > 0u ) )
            uint8_t txFifoWatermark;
            uint8_t rxFifoWatermark;
        #endif
    } hal_uart_config_t;

    #if ( defined( HAL_UART_DMA_ENABLE ) && ( HAL_UART_DMA_ENABLE > 0U ) )
/*! @brief UART DMA status */
        typedef enum _hal_uart_dma_status
        {
            kStatus_HAL_UartDmaSuccess = 0U,
            kStatus_HAL_UartDmaRxIdle = ( 1U << 1U ),
            kStatus_HAL_UartDmaRxBusy = ( 1U << 2U ),
            kStatus_HAL_UartDmaTxIdle = ( 1U << 3U ),
            kStatus_HAL_UartDmaTxBusy = ( 1U << 4U ),
            kStatus_HAL_UartDmaIdleline = ( 1U << 5U ),
            kStatus_HAL_UartDmaError = ( 1U << 6U ),
        } hal_uart_dma_status_t;

        typedef struct _hal_uart_dma_config_t
        {
            uint8_t uart_instance;
            uint8_t dma_instance;
            uint8_t rx_channel;
            uint8_t tx_channel;
            #if defined( FSL_FEATURE_SOC_DMAMUX_COUNT ) && FSL_FEATURE_SOC_DMAMUX_COUNT
                uint8_t dma_mux_instance;
                dma_request_source_t rx_request;
                dma_request_source_t tx_request;
            #endif
            #if defined( FSL_FEATURE_EDMA_HAS_CHANNEL_MUX ) && FSL_FEATURE_EDMA_HAS_CHANNEL_MUX
                uint32_t dma_rx_channel_mux;
                uint32_t dma_tx_channel_mux;
            #endif
        } hal_uart_dma_config_t;
    #endif /* HAL_UART_DMA_ENABLE */

/*! @brief UART transfer callback function. */
    typedef void (* hal_uart_transfer_callback_t)( hal_uart_handle_t handle,
                                                   hal_uart_status_t status,
                                                   void * callbackParam );

    #if ( defined( HAL_UART_DMA_ENABLE ) && ( HAL_UART_DMA_ENABLE > 0U ) )
        typedef struct _dma_callback_msg
        {
            hal_uart_dma_status_t status;
            uint8_t * data;
            uint32_t dataSize;
        } hal_dma_callback_msg_t;

/*! @brief UART transfer callback function. */
        typedef void (* hal_uart_dma_transfer_callback_t)( hal_uart_dma_handle_t handle,
                                                           hal_dma_callback_msg_t * msg,
                                                           void * callbackParam );
    #endif /* HAL_UART_DMA_ENABLE */

/*! @brief UART transfer structure. */
    typedef struct _hal_uart_transfer
    {
        uint8_t * data;  /*!< The buffer of data to be transfer.*/
        size_t dataSize; /*!< The byte count to be transfer. */
    } hal_uart_transfer_t;

/*******************************************************************************
 * API
 ******************************************************************************/

    #if defined( __cplusplus )
    extern "C" {
    #endif /* _cplusplus */

/*!
 * @name Initialization and deinitialization
 * @{
 */

/*!
 * @brief Initializes a UART instance with the UART handle and the user configuration structure.
 *
 * This function configures the UART module with user-defined settings. The user can configure the configuration
 * structure. The parameter handle is a pointer to point to a memory space of size #HAL_UART_HANDLE_SIZE allocated by
 * the caller. Example below shows how to use this API to configure the UART.
 *  @code
 *   UART_HANDLE_DEFINE(g_UartHandle);
 *   hal_uart_config_t config;
 *   config.srcClock_Hz = 48000000;
 *   config.baudRate_Bps = 115200U;
 *   config.parityMode = kHAL_UartParityDisabled;
 *   config.stopBitCount = kHAL_UartOneStopBit;
 *   config.enableRx = 1;
 *   config.enableTx = 1;
 *   config.enableRxRTS = 0;
 *   config.enableTxCTS = 0;
 *   config.instance = 0;
 *   HAL_UartInit((hal_uart_handle_t)g_UartHandle, &config);
 *  @endcode
 *
 * @param handle Pointer to point to a memory space of size #HAL_UART_HANDLE_SIZE allocated by the caller.
 * The handle should be 4 byte aligned, because unaligned access doesn't be supported on some devices.
 * You can define the handle in the following two ways:
 * #UART_HANDLE_DEFINE(handle);
 * or
 * uint32_t handle[((HAL_UART_HANDLE_SIZE + sizeof(uint32_t) - 1U) / sizeof(uint32_t))];
 * @param config Pointer to user-defined configuration structure.
 * @retval kStatus_HAL_UartBaudrateNotSupport Baudrate is not support in current clock source.
 * @retval kStatus_HAL_UartSuccess UART initialization succeed
 */
    hal_uart_status_t HAL_UartInit( hal_uart_handle_t handle,
                                    const hal_uart_config_t * config );

/*!
 * @brief Deinitializes a UART instance.
 *
 * This function waits for TX complete, disables TX and RX, and disables the UART clock.
 *
 * @param handle UART handle pointer.
 * @retval kStatus_HAL_UartSuccess UART de-initialization succeed
 */
    hal_uart_status_t HAL_UartDeinit( hal_uart_handle_t handle );

/*! @}*/

/*!
 * @name Blocking bus Operations
 * @{
 */

/*!
 * @brief Reads RX data register using a blocking method.
 *
 * This function polls the RX register, waits for the RX register to be full or for RX FIFO to
 * have data, and reads data from the RX register.
 *
 * @note The function #HAL_UartReceiveBlocking and the function HAL_UartTransferReceiveNonBlocking
 * cannot be used at the same time.
 * And, the function HAL_UartTransferAbortReceive cannot be used to abort the transmission of this function.
 *
 * @param handle UART handle pointer.
 * @param data Start address of the buffer to store the received data.
 * @param length Size of the buffer.
 * @retval kStatus_HAL_UartError An error occurred while receiving data.
 * @retval kStatus_HAL_UartParityError A parity error occurred while receiving data.
 * @retval kStatus_HAL_UartSuccess Successfully received all data.
 */
    hal_uart_status_t HAL_UartReceiveBlocking( hal_uart_handle_t handle,
                                               uint8_t * data,
                                               size_t length );

/*!
 * @brief Writes to the TX register using a blocking method.
 *
 * This function polls the TX register, waits for the TX register to be empty or for the TX FIFO
 * to have room and writes data to the TX buffer.
 *
 * @note The function #HAL_UartSendBlocking and the function HAL_UartTransferSendNonBlocking
 * cannot be used at the same time.
 * And, the function HAL_UartTransferAbortSend cannot be used to abort the transmission of this function.
 *
 * @param handle UART handle pointer.
 * @param data Start address of the data to write.
 * @param length Size of the data to write.
 * @retval kStatus_HAL_UartSuccess Successfully sent all data.
 */
    hal_uart_status_t HAL_UartSendBlocking( hal_uart_handle_t handle,
                                            const uint8_t * data,
                                            size_t length );

/*! @}*/

